docs/posts/2008-05-19-international-aid-and-religious-freedom.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>International Aid and Religious Freedom</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">International Aid and Religious Freedom</h1>
<p class="subtitle" role="doc-subtitle">May 19, 2008</p>
</header><p>
I am a Baptist who is committed to religious freedom, and I think that the separation of church and state is critical for maintaining religious freedom. I also believe in the value of the classical liberal tradition, in which everyone should have the freedom to choose their own values and act to achieve what they think is good, provided that it does not interfere with another&rsquo;s ability to do the same. So, I am generally suspicious of legislation that interferes with the liberties of other people when my religious beliefs provide the sole reason for favoring the proposed law.
</p>

<p>
I am, however, advocating that the country increase the amount of money that we spend on international aid, specifically aid that is designed to reduce poverty. Yesterday, I claimed that this is consistent with the teachings of Jesus, but even aside from religious motivations, such aid is in our national interest. One could liken it to the rebuilding of Europe and Japan following World War II. Post-war reconstruction was not only the morally right thing to do, it also had immense national security benefits.
</p>

<p>
This same point was made by National Security Advisor Stephen Hadley in an <a href="http://www.whitehouse.gov/news/releases/2008/02/20080204-5.html">address</a> to the Carnegie Endowment for International Peace in February. Let&rsquo;s not simply rest on our past achievements, though.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
